import React from 'react'
import Box from '@mui/material/Box';
import { Typography,  Grid, Button,  CardMedia, CardContent,  Card, CardActions, CardActionArea,  } from '@mui/material';

function Feed() {
  return (
    
    <Box bgcolor="white" flex={4}>  
      <div style={{ marginTop: 20, padding: 30 }}>
      <Grid container spacing={40} justify="center">
 
        
          <Grid>
            <Card>
              <CardActionArea>
                <CardMedia
                  component="img"
                  alt="Contemplative Reptile"
                  height="140"
                
                  title="Contemplative Reptile"
                />
                <CardContent>
                  <Typography gutterBottom variant="h5" component="h2">
                
                  </Typography>
                  <Typography component="p"></Typography>
                </CardContent>
              </CardActionArea>
              <CardActions>
                <Button size="small" color="primary">
                  Share
                </Button>
                <Button size="small" color="primary">
                  Learn More
                </Button>
              </CardActions>
            </Card>
          </Grid>
        
      </Grid>
    </div>


    
    
    <b>Танилцуулга</b>

    “Автотээврийн үндэсний төв” төрийн өмчит үйлдвэрийн газар нь Зам, тээврийн хөгжлийн сайдын эрхлэх асуудлын хүрээнд автотээврийн талаар төрөөс баримтлах бодлого, хууль тогтоомжийн хэрэгжилтийг зохицуулж, зохион байгуулах үндсэн чиг үүрэгтэй байгууллага юм. 
    
    Автотээврийн тухай хууль, Засгийн газрын тогтоол болон дүрмэнд заасны дагуу тус үндэсний төв дараах чиглэлээр улсын хэмжээнд үйл ажиллагаа явуулж байна. Үүнд:
    
        Автотээврийн хэрэгсэлд техникийн хяналтын үзлэг хийх;
    
        Монгол Улсын нутаг дэвсгэрт ашиглагдаж байгаа автотээврийн хэрэгслийн бүртгэлээс хөтлөх, улсын дугаар олгох, шилжилт хөдөлгөөн бүртгэх, бүртгэлээс хасах, тээврийн хэрэгслийн гэрчилгээ болон улсын дугаар нөхөн олгох, автотээврийн хэрэгслийн талаарх мэдээллийн сан, бүртгэлийн сүлжээ байгуулах, мэдээллээр хангах;
    
        Улс хооронд, хот хооронд, орон нутгийн зорчигч болон, ачаа тээвэр, шуудан нийтийн тээвэр, жуулчин тээвэрлэлтийн үйлчилгээ болон дамжин өнгөрөх тээвэрлэлтийн үйлчилгээг улсын хэмжээнд зохицуулах, зохион байгуулах;
    
        Улс хооронд, хот хооронд орон нутгийн нийтийн зорчигч болон ачаа тээвэр, шуудан, жуулчин тээвэрлэлтийн үйлчилгээг улсын хэмжээнд зохицуулах, зохион байгуулах үйлчилгээг нийтийн зорчигч тээврийн ажил, үйлчилгээ эрхлэх аж ахуйн нэгж, байгууллагатай гэрээ байгуулж гүйцэтгүүлэх;
    
        Улс хооронд, хот хооронд, орон нутгийн нийтийн зорчигч, ачаа болон дамжин өнгөрөх тээвэрлэлт гүйцэтгэж байгаа тээврийн хэрэгслийн хөдөлгөөнийг хянах, мэдээллээр хангах;
    
        Автотээврийн хэрэгслийн мэргэшсэн жолоочийн шалгалт авах, үнэмлэх олгох;
    
        Улс, олон улс хоорондын зорчигч тээвэрлэлтийн үйлчилгээ эрхлэх;
    
        Авто үйлчилгээний байгууллагад ангилал тогтоох үйл ажиллагааг аймаг орон нутагт зохион байгуулах;
    
        Төрийн захиалгат ажил, үйлчилгээг гэрээний үндсэн дээр гүйцэтгэх;
    
        Улс, хот хооронд, орон нутгийн ачаа, зорчигч тээвэрлэлт гүйцэтгэх аж ахуйн нэгж, байгууллагын хүсэлтийг судлан, хууль тогтоомжид заасан шаардлагыг хангаж буй эсэх талаар дүгнэлт гаргах, дүгнэлтийг автотээврийн асуудал эрхэлсэн төрийн захиргааны төв байгууллага болон аймаг, сумын Засаг даргад хүргүүлэх
        Чанарын удирдлагын тогтолцоог нэвтрүүлж, техникийн хяналт, засвар үйлчилгээний хэмжлийн тоног төхөөрөмжүүдийг шалгалт тохируулга, баталгаажуулалт хийх;
    
    Автотээврийн үндэсний төв нь Улаанбаатар хотод Сонгинохайрхан, Баянзүрх, Баянгол техникийн хяналтын үзлэгийн төв, хот хоорондын зорчигч тээврийн Баянзүрх, Сонгинохайрхан зорчигч тээврийн төв болон орон нутагт 23, улсын хэмжээнд нийт 29 салбартай бөгөөд дүрэмд заасан зарим чиг үүргээ салбаруудаараа дамжуулан хэрэгжүүлж байна.
   
    </Box>
  
  )
}

export default Feed